reports/mysql-coupon-loadtest/runs/batch-sync-500rps-001/k6-console.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/coupon-arrival-rate.js
        output: -

     scenarios: (100.00%) 1 scenario, 6000 max VUs, 40s max duration (incl. graceful stop):
              * unique_member_first_request: 500.00 iterations/s for 10s (maxVUs: 3000-6000, gracefulStop: 30s)


running (00.4s), 0210/3000 VUs, 0 complete and 0 interrupted iterations
unique_member_first_request   [   4% ] 0210/3000 VUs  00.4s/10s  500.00 iters/s

running (01.4s), 0685/3000 VUs, 31 complete and 0 interrupted iterations
unique_member_first_request   [  14% ] 0685/3000 VUs  01.4s/10s  500.00 iters/s

running (02.4s), 1119/3000 VUs, 97 complete and 0 interrupted iterations
unique_member_first_request   [  24% ] 1119/3000 VUs  02.4s/10s  500.00 iters/s

running (03.4s), 1553/3000 VUs, 163 complete and 0 interrupted iterations
unique_member_first_request   [  34% ] 1553/3000 VUs  03.4s/10s  500.00 iters/s

running (04.4s), 1994/3000 VUs, 222 complete and 0 interrupted iterations
unique_member_first_request   [  44% ] 1994/3000 VUs  04.4s/10s  500.00 iters/s

running (05.4s), 2392/3000 VUs, 324 complete and 0 interrupted iterations
unique_member_first_request   [  54% ] 2392/3000 VUs  05.4s/10s  500.00 iters/s

running (06.4s), 2693/3000 VUs, 522 complete and 0 interrupted iterations
unique_member_first_request   [  64% ] 2693/3000 VUs  06.4s/10s  500.00 iters/s

running (07.4s), 3047/3047 VUs, 613 complete and 0 interrupted iterations
unique_member_first_request   [  74% ] 3047/3047 VUs  07.4s/10s  500.00 iters/s

running (08.4s), 3231/3231 VUs, 715 complete and 0 interrupted iterations
unique_member_first_request   [  84% ] 3231/3231 VUs  08.4s/10s  500.00 iters/s

running (09.4s), 3411/3411 VUs, 815 complete and 0 interrupted iterations
unique_member_first_request   [  94% ] 3411/3411 VUs  09.4s/10s  500.00 iters/s

running (10.4s), 3444/3498 VUs, 901 complete and 0 interrupted iterations
unique_member_first_request ↓ [ 100% ] 3497/3498 VUs  10s  500.00 iters/s

running (11.4s), 3342/3498 VUs, 1003 complete and 0 interrupted iterations
unique_member_first_request ↓ [ 100% ] 3497/3498 VUs  10s  500.00 iters/s

running (12.4s), 3100/3498 VUs, 1245 complete and 0 interrupted iterations
unique_member_first_request ↓ [ 100% ] 3497/3498 VUs  10s  500.00 iters/s

running (13.4s), 2631/3498 VUs, 1714 complete and 0 interrupted iterations
unique_member_first_request ↓ [ 100% ] 3497/3498 VUs  10s  500.00 iters/s

running (14.4s), 2130/3498 VUs, 2215 complete and 0 interrupted iterations
unique_member_first_request ↓ [ 100% ] 3497/3498 VUs  10s  500.00 iters/s

running (15.4s), 1630/3498 VUs, 2715 complete and 0 interrupted iterations
unique_member_first_request ↓ [ 100% ] 3497/3498 VUs  10s  500.00 iters/s

running (16.4s), 1130/3498 VUs, 3215 complete and 0 interrupted iterations
unique_member_first_request ↓ [ 100% ] 3497/3498 VUs  10s  500.00 iters/s

running (17.4s), 0685/3498 VUs, 3660 complete and 0 interrupted iterations
unique_member_first_request ↓ [ 100% ] 3497/3498 VUs  10s  500.00 iters/s

running (18.4s), 0399/3498 VUs, 3946 complete and 0 interrupted iterations
unique_member_first_request ↓ [ 100% ] 3497/3498 VUs  10s  500.00 iters/s

running (19.4s), 0119/3498 VUs, 4226 complete and 0 interrupted iterations
unique_member_first_request ↓ [ 100% ] 3497/3498 VUs  10s  500.00 iters/s


  █ TOTAL RESULTS 

    checks_total.......: 4345   217.03054/s
    checks_succeeded...: 14.98% 651 out of 4345
    checks_failed......: 85.01% 3694 out of 4345

    ✗ business response or no server error
      ↳  14% — ✓ 651 / ✗ 3694

    CUSTOM
    coupon_issue_business_response_under_2s...: 2.00%  87 out of 4345
    coupon_issue_issued.......................: 651    32.517119/s
    coupon_issue_rejected.....................: 435    21.728029/s

    HTTP
    http_req_duration.........................: avg=8.96s min=399.94ms med=9.99s max=10.08s p(90)=10s   p(95)=10s   p(99)=10.01s
      { expected_response:true }..............: avg=5.17s min=399.94ms med=5.22s max=9.98s  p(90)=8.67s p(95)=9.71s p(99)=9.95s 
    http_req_failed...........................: 85.01% 3694 out of 4345
    http_reqs.................................: 4345   217.03054/s

    EXECUTION
    dropped_iterations........................: 655    32.716917/s
    iteration_duration........................: avg=8.96s min=405.46ms med=10s   max=10.08s p(90)=10s   p(95)=10s   p(99)=10.01s
    iterations................................: 4345   217.03054/s
    vus.......................................: 119    min=119          max=3444
    vus_max...................................: 3498   min=3000         max=3498

    NETWORK
    data_received.............................: 231 kB 12 kB/s
    data_sent.................................: 1.3 MB 67 kB/s



running (20.0s), 0000/3498 VUs, 4345 complete and 0 interrupted iterations
unique_member_first_request ✓ [ 100% ] 0000/3498 VUs  10s  500.00 iters/s